function draw1() {
  var myChart = echarts.init(document.getElementById("main"));

  option = {
    title: {
      text: "Yield Strength vs Total Elongation",
    },
    tooltip: {
      trigger: "axis",
    },
    legend: {
      data: ["Data"],
    },
    toolbox: {
      show: true,
      feature: {
        dataZoom: {},
        dataView: { readOnly: false },
        magicType: { type: ["line", "bar"] },
        restore: {},
        saveAsImage: {},
      },
    },
    xAxis: {
      type: "value",
      name: "Yield strength/ MPa",
      nameLocation: 'middle',
      nameGap: 30,
      min: 0,
      max: 2000,
    },
    yAxis: {
      type: "value",
      name: "Total elongation/ %",
      min: 0,
      max: 100,
    },
    series: [
      {
        name: "Data",
        type: "scatter",
        data: [
          [1871.665906649656, 29.37634321863638],
          [1952.0392739421209, 84.36079640151057],
          [295.8328559018488, 91.30467316534691],
          [1633.9331233044613, 1.9031812613017007],
          [66.32584719681466, 39.0188023523681],
          [1905.1317787778992, 53.81939533322667],
          [465.47427404423615, 97.44226181566125],
          [481.327935947927, 37.11437513962714],
          [159.66403716819477, 83.7840311632808],
          [503.33279714388766, 60.1470952126543],
          [1515.561288137262, 17.73970200497822],
          [563.2729915832671, 69.56422552352448],
          [1788.7442052640683, 69.9189738342987],
          [143.72569213411325, 20.816245397412448],
          [321.23496781637704, 61.809204973670305],
          [206.68653838108898, 4.368063120660692],
          [1786.2544725545984, 80.23316959522381],
          [1139.3699496109145, 17.98984292399237],
          [88.30588858923471, 78.87491087267581],
          [691.0155346797043, 58.58467944541258],
        ],
      },
    ],
  };

  myChart.setOption(option);
}

function draw_default() {
  // 基于准备好的dom，初始化echarts实例
  var myChart = echarts.init(document.getElementById("main"));

  // 指定图表的配置项和数据
  option = {
    xAxis: {},
    yAxis: {},
    series: [
      {
        symbolSize: 20,
        data: [
          [10.0, 8.04],
          [8.07, 6.95],
          [13.0, 7.58],
          [9.05, 8.81],
          [11.0, 8.33],
          [14.0, 7.66],
          [13.4, 6.81],
          [10.0, 6.33],
          [14.0, 8.96],
          [12.5, 6.82],
          [9.15, 7.2],
          [11.5, 7.2],
          [3.03, 4.23],
          [12.2, 7.83],
          [2.02, 4.47],
          [1.05, 3.33],
          [4.05, 4.96],
          [6.03, 7.24],
          [12.0, 6.26],
          [12.0, 8.84],
          [7.08, 5.82],
          [5.02, 5.68],
        ],
        type: "scatter",
      },
    ],
  };

  // 使用刚指定的配置项和数据显示图表。
  myChart.setOption(option);
}

draw1()
